fedex_ups/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-02 Thu 11:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>FedEx vs UPS: Case Notes and Questions</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matt Brigida, Ph.D." />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">FedEx vs UPS: Case Notes and Questions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0360b8a">1. Concepts to Review/Highlight:</a>
<ul>
<li><a href="#org4a9d902">1.1. Financial Ratios</a></li>
<li><a href="#orgbb72da3">1.2. Net Operating Profit After Tax (NOPAT)</a></li>
<li><a href="#org34ad4c3">1.3. Economic Value Added (EVA)</a></li>
<li><a href="#org7affd37">1.4. WACC</a>
<ul>
<li><a href="#org1f26950">1.4.1. Cost of Debt</a></li>
<li><a href="#org827e77d">1.4.2. Cost of Equity</a></li>
<li><a href="#org596b982">1.4.3. Putting it together to calculate the WACC</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb939b4f">2. Case and Discussion Questions</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0360b8a" class="outline-2">
<h2 id="org0360b8a"><span class="section-number-2">1</span> Concepts to Review/Highlight:</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4a9d902" class="outline-3">
<h3 id="org4a9d902"><span class="section-number-3">1.1</span> Financial Ratios</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Financial ratio values can be volatile. Don't pick out one ratio for one particular year and draw conclusions from it&#x2014;it could be due to particular charges unique to that year.  Instead, look at the trend in the ratio over time and its relation over time to the same ratio at a similar firm.</li>

<li>Know what are good values of a particular ratio.</li>

<li>Many different ratios measure the same thing, so don't spend time analyzing each.  For example, we can see that Fedex's debt to equity ratio is declining.  Given this we would <b>expect</b> its Time-Interest-Earned ratio to increase, which it does.  So there is no need to discuss both ratios.  It is possible, though rare, that the Time-Interest-Earned ratio may not increase.  If this were the case then discussing why would be relevant.</li>
</ol>
</div>
</div>
<div id="outline-container-orgbb72da3" class="outline-3">
<h3 id="orgbb72da3"><span class="section-number-3">1.2</span> Net Operating Profit After Tax (NOPAT)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Measures such as NOPAT and Earnings Before Interest and Taxes (EBIT) attempt to estimate a firm's cash flow.
</p>
</div>
</div>





<div id="outline-container-org34ad4c3" class="outline-3">
<h3 id="org34ad4c3"><span class="section-number-3">1.3</span> Economic Value Added (EVA)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
EVA is a method of measuring corporate performance that is used in many prominent firms such as AT&amp;T , Coca-Cola, and Toyota.  The idea is to compare cash flow the firm generates to the payments the firm must make to debt and equity holders (WACC times capital).  Ideally these should be market values, however we often must work with accounting values.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">NOPAT</span> = 1448;
<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">Capital</span> = 9679; <span style="color: #586e75; font-style: italic;">/*</span><span style="color: #586e75; font-style: italic;">Capital employed in the business or operation, how does this differ from total assets?</span><span style="color: #586e75; font-style: italic;">*/</span>
<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">RONA</span> = NOPAT / Capital; <span style="color: #586e75; font-style: italic;">//</span><span style="color: #586e75; font-style: italic;">return on net assets</span>
<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">WACC</span> = 0.1272;
<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">EVA</span> = (RONA - WACC) * Capital;
printf(<span style="color: #2aa198;">"The Economic Value Added is $%.2f\n"</span>, EVA);
</pre>
</div>

<pre class="example">
The Economic Value Added is $216.83

</pre>
</div>
</div>

<div id="outline-container-org7affd37" class="outline-3">
<h3 id="org7affd37"><span class="section-number-3">1.4</span> WACC</h3>
<div class="outline-text-3" id="text-1-4">
<p>
\(WACC = w_e r_e + w_d r_d (1 - \tau)\)
</p>

<p>
where \(w_e\) and \(w_d\) is the weight of equity and debt, respectively in the capital structure.  \(r_e\) and \(r_d\) are the required returns on equity and debt, and \(\tau\) is the tax rate.
</p>
</div>

<div id="outline-container-org1f26950" class="outline-4">
<h4 id="org1f26950"><span class="section-number-4">1.4.1</span> Cost of Debt</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
We get the cost of debt by observing the yield-to-maturity on the firm's outstanding debt.  If the debt is not traded, we may have to find similar debt that is traded.  
</p>
</div>
</div>

<div id="outline-container-org827e77d" class="outline-4">
<h4 id="org827e77d"><span class="section-number-4">1.4.2</span> Cost of Equity</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
We can get \(r_e\) from the CAPM: \(r_e = r_f + \beta_e (r_m - r_f)\)  Using a python class and method to calculate the return on equity.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">class</span> <span style="color: #268bd2;">CAPMdata</span>:
<span style="color: #586e75; background-color: #073642;"> </span>   <span style="color: #586e75; background-color: #073642;"> </span><span style="color: #d33682;">"""a data structure to hold capm data"""</span>
<span style="color: #586e75; background-color: #073642;"> </span>   <span style="color: #586e75; background-color: #073642;"> </span><span style="color: #859900;">def</span> <span style="color: #b58900;">__init__</span><span style="color: #839496;">(</span><span style="color: #859900;">self</span>, risk_free, beta, return_market<span style="color: #839496;">)</span>:
         <span style="color: #859900;">self</span>.rf = risk_free
         <span style="color: #859900;">self</span>.b = beta
         <span style="color: #859900;">self</span>.rm = return_market

<span style="color: #586e75; background-color: #073642;"> </span>   <span style="color: #586e75; background-color: #073642;"> </span><span style="color: #859900;">def</span> <span style="color: #b58900;">capm</span><span style="color: #839496;">(</span><span style="color: #859900;">self</span><span style="color: #839496;">)</span>:
         <span style="color: #859900;">return</span> <span style="color: #859900;">self</span>.rf + <span style="color: #859900;">self</span>.b * <span style="color: #839496;">(</span><span style="color: #859900;">self</span>.rm - <span style="color: #859900;">self</span>.rf<span style="color: #839496;">)</span>

<span style="color: #859900;">print</span><span style="color: #839496;">(</span><span style="color: #2aa198;">"This required return on equity is {0:.2%}"</span>.<span style="color: #6c71c4;">format</span><span style="color: #2aa198;">(</span>CAPMdata<span style="color: #b58900;">(</span>.03, 1.5, .08<span style="color: #b58900;">)</span>.capm<span style="color: #b58900;">()</span><span style="color: #2aa198;">)</span><span style="color: #839496;">)</span>
</pre>
</div>

<pre class="example">
This required return on equity is 10.50%

</pre>
</div>
</div>

<div id="outline-container-org596b982" class="outline-4">
<h4 id="org596b982"><span class="section-number-4">1.4.3</span> Putting it together to calculate the WACC</h4>
<div class="outline-text-4" id="text-1-4-3">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #268bd2;">double</span> <span style="color: #b58900;">capm</span>(<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">rf</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">beta</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">rm</span>){
<span style="color: #859900;">return</span> rf + beta * (rm - rf);
}

<span style="color: #268bd2;">double</span> <span style="color: #b58900;">wacc</span>(<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">wd</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">we</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">re</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">rd</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">tax</span>){
<span style="color: #859900;">return</span> we * re + wd * rd * (1 - tax);
}

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span>(){

<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">wd</span> = .4;
<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">rd</span> = .05;
<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">we</span> = 1 - wd;
<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">re</span> = capm(.02, 1.5, .08);
<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">tax</span> = .4;

  printf(<span style="color: #2aa198;">"The WACC is %.2f\%\n"</span>, 100 * wacc(wd, we, rd, re, tax));
}

</pre>
</div>

<pre class="example">
The WACC is 5.64%

</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-orgb939b4f" class="outline-2">
<h2 id="orgb939b4f"><span class="section-number-2">2</span> Case and Discussion Questions</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Have FedEx and UPS achieved their stated goals?
<ul class="org-ul">
<li>Fedex's goal: "superior financial returns".</li>
<li>UPS's goal: "long-term competitive return".</li>
</ul></li>
<li>Can strong performance be expected in the future?</li>
<li>What has been the effect of the intense competition between the firms?</li>
<li>Which firm would you say is performing "better", and how might we define better?</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2020-07-02 Thu 11:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
